// Написать функцию, которая находит индекс первого числа, кратного 3

// const someNumbers = [1, 2, 3, 4, 5]

// function getIndex(value) {
//     return value.findIndex((value, index) => value % 3 === 0 && index)
// }

// console.log(getIndex(someNumbers));



// Написать функцию, которая находит индекс первого имени, длина которого больше 5
// Написать функцию, которая находит индекс первого true из массива любых типов данных

// Написать функцию, которая ищет среди массива чисел первое встречное отрицательное число
// Написать функцию, которая ищет среди массива имен первое встречное имя с длиной строки меньшее 4

// Написать функцию, которая мутирует массив, заменяя все чётные на 777
// Написать функцию, которая мутирует массив, заменяя все строки на число 0
// Написать функцию, которая выводит в консоль только чётные индексы, начиная с 2

// const userList = [
//     { age: 20, name: 'ALex' },
//     { age: 10, name: 'alex' },
//     { age: 110, name: 'Pavel' },
//     { age: 8, name: 'Oksana' },
//     { age: 15, name: 'Dima' },
//     { age: 45, name: 'Lexus' },
//     { age: 95, name: 'Deda' },
// ]
// Написать функцию, которая возвращает из массива пользователей всех пользователей, чьё имя длинее 6 символов
// Написать функцию, которая возвращает из массива чисел все чётные числа
// Написать функцию, которая возвращает из массива строк все строки, которые написаны строго в нижнем регистре (Если хотя бы одна буква большая, то такое слово не подходит)