// 4 тема - js(Основы типа String)

// 1) Что такое escape - последовательности(\n \t  \\ ...)



// 2) Как узнать количество символов в строке ? +
// Узнать количество символов в строке можно через свойство length.

// let text = "JavaScript";
// text.length; // 10.



// 3) Преобразовать строку к верхнему / нижнему регистру +

// let down = "НИЖНИЙ РЕГИСТР";
// console.log(down.toLowerCase());

// let up = "Верхний регистр";
// console.log(up.toUpperCase());



// 4) Как преобразовать число к типу String +
// явно указать тип

// let num = String(10);
// console.log(typeof num);



// 5) 3 способа вывести в консоль: через запятую, через конкатенацию, через шаблонные литералы(заодно узнать что это)