// 6 тема - js (Условия) + задачи из второй темы (см. сообщения выше)
// 2-practice.js - сделано

// 1. Синтаксис
// // Оператор if ()
// // Оператор else
// // Оператор else if ()

// 2. Как проверить попали мы в промежуток:
// а) От 0 вкл. до 10 вкл или нет
// б)  От 5 вкл. до 15 не вкл.

// 3. Как проверить является ли число чётным или нет

// 4. Как проверить делится ли число на 193?

// 5. Как проверить переменную на тип number, string, null, undefined

// 6. Как проверить переменную на NaN? 

// 7. switch - case (синтаксис), зачем нужен break?

// 8. Тернарный оператор