// Задача (hard-level)

// ? Создайте функцию calculate. Функция должна принимать арифметические операции двух чисел в виде строки и возвращать строку с результатом их выполнения.
// Функция принимает данные из аргумента и возвращает с помощью return.
// Разбейте ваше решение на функции, отвечающие за разные области.
// Задача, которая состоит из одной функции – не засчитывается!
// •	Калькулятор умеет выполнять операции сложения, вычитания, умножения и деления с двумя числами: a + b, a - b, a * b, a / b. Данные передаются в виде одной строки!
// •	Калькулятор умеет работать как с арабскими (1,2,3,4,5…), так и с римскими (I,II,III,IV,V…) числами.
// •	Калькулятор должен принимать на вход числа от 1 до 10 включительно, не более. На выходе числа не ограничиваются по величине и могут быть любыми.
// •	Калькулятор умеет работать только с целыми числами.
// •	Результат на выходе всегда строка с целым числом. В делении учитываем только целую часть.
// •	Калькулятор умеет работать только с арабскими или римскими цифрами одновременно, при вводе пользователем строки вроде 3 + II калькулятор должен бросить error и прекратить свою работу.
// •	Т.к. в римской системе нет нуля и отрицательных чисел - возвращаем пустую строку.
// •	При вводе пользователем неподходящих чисел калькулятор должен бросить error и завершить свою работу.
// •	При вводе пользователем строки, не соответствующей одной из вышеописанных арифметических операций приложение бросить error и завершает свою работу.

